---
title: "Модели кредитного риска"
category: "Управление рисками"
order: 79
lang: "ru"
---
# Модели кредитного риска

Моделирование кредитного риска делится на две парадигмы: **структурные модели**, выводящие дефолт из экономики баланса фирмы, и **редуцированные (интенсивностные) модели**, трактующие дефолт как экзогенное случайное событие, управляемое стохастическим процессом интенсивности. Каждый подход обладает своими калибровочными свойствами; на практике часто используют оба — структурные для фундаментального анализа, редуцированные для ценообразования деривативов.

## Структурные модели

### Мертон (1974)

Ключевая идея Роберта Мертона: **акционерный капитал — колл-опцион на стоимость активов фирмы**. Стоимость активов $V_t$ следует геометрическому броуновскому движению:

$$
dV_t = \mu V_t\,dt + \sigma_V V_t\,dW_t
$$

Фирма выпустила бескупонный долг номиналом $D$ с погашением в момент $T$. Дефолт наступает, если $V_T < D$. Стоимость акционерного капитала:

$$
E = V_0 \Phi(d_1) - D e^{-rT} \Phi(d_2)
$$

где:

$$
d_1 = \frac{\ln(V_0/D) + (r + \sigma_V^2/2)T}{\sigma_V \sqrt{T}}, \quad d_2 = d_1 - \sigma_V \sqrt{T}
$$

Риск-нейтральная вероятность дефолта:

$$
PD = \Phi(-d_2) = \Phi\!\left(-\frac{\ln(V_0/D) + (r - \sigma_V^2/2)T}{\sigma_V\sqrt{T}}\right)
$$

### Расстояние до дефолта

**Расстояние до дефолта (DD)** под физической мерой:

$$
DD = \frac{\ln(V_0/D) + (\mu - \sigma_V^2/2)T}{\sigma_V\sqrt{T}}
$$

DD измеряет, на сколько стандартных отклонений стоимость активов фирмы отстоит от точки дефолта. KMV-Moody's отображает DD в исторические частоты дефолтов через эмпирическую функцию, получая **ожидаемую частоту дефолта (EDF)**.

### Расширение: первое пересечение

Оригинальная модель Мертона допускает дефолт только в момент погашения. **Блэк-Кокс (1976)** вводит барьер дефолта $B(t)$, который фирма может пересечь в любой момент:

$$
\tau = \inf\{t > 0 : V_t \leq B(t)\}
$$

Для экспоненциального барьера $B(t) = B_0 e^{\gamma t}$ вероятность первого пересечения имеет аналитическое решение.

## Редуцированные модели

### Интенсивностный подход

Дефолт — первый скачок **процесса Кокса** (дважды стохастический пуассоновский процесс) с интенсивностью $\lambda(t)$. Вероятность выживания:

$$
Q(t) = \mathbb{E}\!\left[\exp\!\left(-\int_0^t \lambda(s)\,ds\right)\right]
$$

Цена дефолтной бескупонной облигации:

$$
P(0, T) = \mathbb{E}^{\mathbb{Q}}\!\left[\exp\!\left(-\int_0^T (r_s + \lambda_s(1-R))\,ds\right)\right]
$$

где $R$ — ставка возмещения, $r_s$ — безрисковая короткая ставка.

### Джарроу-Тёрнбулл (1995)

Простейшая интенсивностная модель: постоянная интенсивность $\lambda$ и постоянное возмещение $R$. Кредитный спред:

$$
s(T) \approx \lambda(1 - R)
$$

Калибровка по CDS-спредам немедленна: $\lambda = s / (1-R)$. См. [[credit-derivatives-cds]] для процедуры бутстрапа.

### Даффи-Синглтон (1999)

Обобщение на **зависящую от состояния интенсивность**: $\lambda_t$ может зависеть от макроэкономических факторов, кредитного рейтинга или рыночных наблюдаемых. Цена облигации при допущении «возмещение от рыночной стоимости»:

$$
P(0, T) = \mathbb{E}^{\mathbb{Q}}\!\left[\exp\!\left(-\int_0^T R_s\,ds\right)\right]
$$

где $R_s = r_s + \lambda_s L_s$ — скорректированная на дефолт короткая ставка, $L_s = 1 - R_s^{\text{rec}}$ — потери при дефолте.

## Сравнение подходов

| Свойство | Структурные | Редуцированные |
|:---|:---|:---|
| **Триггер дефолта** | $V_t < D$ (эндогенный) | Скачок процесса Кокса (экзогенный) |
| **Входные данные** | Стоимость активов, волатильность, леверидж | Интенсивность из CDS/облигаций |
| **Калибровка** | Сложная (ненаблюдаемый $V_t$) | Простая (из рыночных спредов) |
| **Краткосрочная PD** | Почти нулевая (диффузия) | Положительная (скачковый риск) |
| **Экономическая интуиция** | Высокая (баланс) | Низкая (статистическая) |
| **Применение** | Фундаментальный анализ, EDF | Ценообразование деривативов, CVA |

## Модели кредитной миграции

### CreditMetrics (JP Morgan, 1997)

Моделирует кредитный риск через **рейтинговые переходы**. Матрица годовых переходов $\Pi$ содержит вероятности $\pi_{ij}$ миграции из рейтинга $i$ в рейтинг $j$. Распределение убытков портфеля:

1. Для каждого заёмщика симулируется латентная переменная $X_i = \sqrt{\rho}\,M + \sqrt{1-\rho}\,Z_i$
2. $X_i$ отображается в новый рейтинг через квантильные пороги из $\Pi$
3. Облигации переоцениваются по кривой спредов нового рейтинга
4. Агрегируются изменения mark-to-market портфеля

### Формула Basel IRB

Подход Basel IRB (Internal Ratings-Based) использует однофакторную гауссову копулу (структурно идентичную моделям [[cdo-tranches]]) для регуляторного капитала:

$$
K = \text{LGD} \cdot \Phi\!\left(\frac{\Phi^{-1}(PD) + \sqrt{\rho}\,\Phi^{-1}(0.999)}{\sqrt{1-\rho}}\right) - PD \cdot \text{LGD}
$$

где $\rho$ — корреляция активов, предписанная Базелем (убывающая по PD), а квантиль 99.9% обеспечивает покрытие капиталом убытка тысячелетнего события.

## Реализация на Python

```python
import numpy as np
from scipy.stats import norm

def merton_default_prob(
    V0: float, D: float, r: float,
    sigma_V: float, T: float
) -> dict:
    """Модель Мертона: стоимость акций, вероятность дефолта, DD."""
    d1 = (np.log(V0 / D) + (r + 0.5 * sigma_V**2) * T) / (sigma_V * np.sqrt(T))
    d2 = d1 - sigma_V * np.sqrt(T)
    equity = V0 * norm.cdf(d1) - D * np.exp(-r * T) * norm.cdf(d2)
    pd_rn = norm.cdf(-d2)
    return {"equity": equity, "PD": pd_rn, "DD": d2}

def intensity_bond_price(
    lambda_: float, R: float, r: float, T: float
) -> float:
    """Цена дефолтной бескупонной облигации при постоянной интенсивности."""
    return np.exp(-(r + lambda_ * (1 - R)) * T)

def basel_irb_capital(
    PD: float, LGD: float, rho: float
) -> float:
    """Требование к капиталу Basel IRB на единицу EAD."""
    return LGD * (norm.cdf(
        (norm.ppf(PD) + np.sqrt(rho) * norm.ppf(0.999)) / np.sqrt(1 - rho)
    ) - PD * LGD)

result = merton_default_prob(V0=100, D=70, r=0.03, sigma_V=0.25, T=1.0)
print(f"Акционерный капитал: {result['equity']:.2f}")
print(f"Вероятность дефолта: {result['PD']:.4%}")
print(f"Расстояние до дефолта: {result['DD']:.2f}")

lam = 0.015 / (1 - 0.4)
bond_px = intensity_bond_price(lam, R=0.4, r=0.03, T=5.0)
print(f"\nИнтенсивность: {lam:.4f}")
print(f"5-летняя дефолтная облигация: {bond_px:.4f}")
```

## Термальная структура вероятности дефолта

```chart
{
  "type": "line",
  "xAxis": "year",
  "data": [
    {"year": "1г", "structural": 0.1, "reduced_form": 1.5},
    {"year": "2г", "structural": 0.8, "reduced_form": 3.0},
    {"year": "3г", "structural": 2.1, "reduced_form": 4.4},
    {"year": "5л", "structural": 5.5, "reduced_form": 7.2},
    {"year": "7л", "structural": 9.2, "reduced_form": 9.8},
    {"year": "10л", "structural": 14.0, "reduced_form": 13.9}
  ],
  "lines": [
    {"dataKey": "structural", "stroke": "#3b82f6", "name": "Структурная (Мертон) PD %"},
    {"dataKey": "reduced_form", "stroke": "#ef4444", "name": "Редуцированная PD %"}
  ]
}
```

## Ограничения и расширения

- **Структурные модели**: ненаблюдаемая стоимость активов требует оценки из цен акций и балансовых данных; краткосрочные PD близки к нулю из-за диффузионного допущения
- **Редуцированные модели**: нет экономического механизма дефолта — интенсивность является статистическим объектом, а не причинным
- **Корреляция**: обе парадигмы расширяются на многоименные случаи через факторные копулы (структурные) или коррелированные интенсивности (редуцированные)
- **Машинное обучение**: современные подходы (GNN-скоринг, модели выживания) объединяют структурные признаки с рыночными интенсивностями — см. [[gnn-credit-risk]] и [[survival-risk-prediction]]

## Связанные темы
- [[credit-derivatives-cds]]
- [[cdo-tranches]]
- [[copula-models]]
- [[xva]]
- [[black-scholes]]
- [[value-at-risk]]
- [[credit-migration]] — матрицы переходов и динамика рейтингов
